<template>
  <div class="dl-icon-os">
    <h1 class="dl" style="padding-top: 30px;">Download</h1>
    <ul class="dl-menu">
      <li v-on:click="scroll('#pos-mac')"><div v-html="mac"/>Mac</li>
      <li v-on:click="scroll('#pos-window')"><div v-html="window"/>Window</li>
      <li v-on:click="scroll('#pos-linux')"><div v-html="linux"/>Linux</li>
      <li v-on:click="scroll('#pos-android')" v-if="!(path === 'Poison')"><div v-html="android"/>Android</li>
    </ul>
  </div>

  <otl-hr id="pos-mac">Mac</otl-hr>
  <div class="dl-icon-os">
    <!-- 다운로드 -->
    <h3 class="dl">다운로드</h3>
    <p>
      <a href="https://git-scm.com/downloads" style="font-weight: bolder">Git</a>으로 코드를 받아오기 때문에 다운로드 전&nbsp;
      <a href="https://git-scm.com/downloads" style="font-weight: bolder">Git</a>이 미리 설치되어 있어야 합니다.
      <br>터미널에 다음 코드를 입력해주시면 세팅과 설치가 자동으로 됩니다.
      <br>설치후 터미널을 다시 실행해주시면 다운로드 받은 세팅을 사용할 수 있습니다.
    </p>
    <otl-code class="otl-code">{{ downloadLink }}</otl-code>
    <!-- 삭제 -->
    <br>
    <h3 class="dl">삭제</h3>
    <p>
      터미널에 다음 코드를 입력해주시면 자동으로 제거가 됩니다.
      <br>입력후 터미널을 재시작하시고 <span style="font-weight: bold">otl</span>을 입력했을때 제거가 되었다면 인식할 수 없는 키워드로 인식하면 제거에 성공한 것 입니다.
    </p>
    <otl-code class="otl-code"><otl-g>otl</otl-g> uninstall</otl-code>
    <!-- 실행 -->
    <br>
    <h3 class="dl">실행</h3>
    <p>
      그냥 <span style="font-weight: bold">otl</span>만 입력했을때 1줄씩 입력을 받습니다.
      <br>현재 한글 입력에 문제가 있으므로 참고 해주세요. (글자를 지울때 일부가 안 지워질때가 있습니다. 한번에 입력하면 문제없이 작동합니다.)
    </p>
    <otl-code><otl-g>otl</otl-g></otl-code>
    <p>현재 위치에서 파일 name을 입력하면 해당 파일을 실행할 수 있습니다.</p>
    <otl-code class="otl-code"><otl-g>otl</otl-g> &lt;파일명&gt;</otl-code>
  </div>
  <!-- Mac 코드 -->

  <otl-hr id="pos-window">Window</otl-hr>
  <h3 class="dl" style="color: red">개발중</h3>
  <!-- Window 코드 -->

  <otl-hr id="pos-linux">Linux</otl-hr>
  <div class="dl-icon-os">
    <h3 class="dl" style="color: red">동작 미확인</h3>
    <otl-hr-vertical/>
    <!-- 다운로드 -->
    <h3 class="dl">다운로드</h3>
    <p>
      <a href="https://git-scm.com/downloads" style="font-weight: bolder">Git</a>으로 코드를 받아오기 때문에 다운로드 전&nbsp;
      <a href="https://git-scm.com/downloads" style="font-weight: bolder">Git</a>이 미리 설치되어 있어야 합니다.
      <br>터미널에 다음 코드를 입력해주시면 세팅과 설치가 자동으로 됩니다.
      <br>설치후 터미널을 다시 실행해주시면 다운로드 받은 세팅을 사용할 수 있습니다.
    </p>
    <otl-code class="otl-code">{{ downloadLink }}</otl-code>
    <!-- 삭제 -->
    <br>
    <h3 class="dl">삭제</h3>
    <p>
      터미널에 다음 코드를 입력해주시면 자동으로 제거가 됩니다.
      <br>입력후 터미널을 재시작하시고 <span style="font-weight: bold">otl</span>을 입력했을때 제거가 되었다면 인식할 수 없는 키워드로 인식하면 제거에 성공한 것 입니다.
    </p>
    <otl-code class="otl-code"><otl-g>otl</otl-g> uninstall</otl-code>
    <!-- 실행 -->
    <br>
    <h3 class="dl">실행</h3>
    <p>
      그냥 <span style="font-weight: bold">otl</span>만 입력했을때 1줄씩 입력을 받습니다.
      <br>현재 한글 입력에 문제가 있으므로 참고 해주세요. (글자를 지울때 일부가 안 지워질때가 있습니다. 한번에 입력하면 문제없이 작동합니다.)
    </p>
    <otl-code><otl-g>otl</otl-g></otl-code>
    <p>현재 위치에서 파일 name을 입력하면 해당 파일을 실행할 수 있습니다.</p>
    <otl-code class="otl-code"><otl-g>otl</otl-g> &lt;파일명&gt;</otl-code>
  </div>
  <!-- Linux 코드 -->

  <otl-hr id="pos-android" v-if="!(path === 'Poison')">Android</otl-hr>
  <div class="dl-icon-os" v-if="!(path === 'Poison')">
    <h3 style="color: red">업데이트 준비 중</h3>
    <otl-hr-vertical/>
    <p>수동 저장 버튼 - 현재 내용을 저장하는 버튼</p>
    <img src="../assets/android/1.jpeg" alt="">
    <p>저장 버튼 - 수동 저장, 자동 저장한 내용을 불러오는 버튼</p>
    <img src="../assets/android/2.jpeg" alt="">
    <p>내보내기 버튼 - 현재 내용을 .otl파일로 만드는 버튼 (경로 - 내장메모리/OTLanguage)</p>
    <img src="../assets/android/3.jpeg" alt="">
    <p>불러오기 버튼 - 경로에 있는 .otl파일을 불러오는 버튼 (경로 - 내장메모리/OTLanguage)</p>
    <img src="../assets/android/4.jpeg" alt="">
    <p>출력내용 삭제 버튼 - 동작 후 출력된 글자를 제거하는 버튼</p>
    <img src="../assets/android/5.jpeg" alt="">
    <p>자동 저장 - 활동화시 자동 저장, 가져오기를 해주는 스위치</p>
    <img src="../assets/android/6.jpeg" alt="">
    <p>시작 버튼 - 코드를 실행시키는 버튼 (동작중에는 멈춤 버튼으로 표시됨)</p>
    <img src="../assets/android/7.jpeg" alt="">
  </div>
  <!-- Android 코드 -->
</template>

<script>
import OtlCode from "@/components/edit/otl-code";
import OtlG from "@/components/code-color/otl-g"
import OtlHr from "@/components/edit/otl-hr"
import OtlHrVertical from "@/components/edit/otl-hr-vertical"

export default {
  components: {
    OtlCode,
    OtlG,
    OtlHr,
    OtlHrVertical
  },
  props: {
    downloadLink: {
      type: String,
      default: "curl https://raw.githubusercontent.com/OTLanguage/.github/main/otlmake.sh | sh"
    }
  },
  data() {
    return {
      mac: `<svg width="50" height="50" role="img" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><title>macOS</title><path d="M0 14.727h.941v-2.453c0-.484.318-.835.771-.835.439 0 .71.276.71.722v2.566h.915V12.25c0-.48.31-.812.764-.812.46 0 .718.28.718.77v2.518h.94v-2.748c0-.801-.517-1.334-1.307-1.334-.578 0-1.054.31-1.247.805h-.023c-.147-.514-.552-.805-1.118-.805-.545 0-.968.306-1.142.771H.903v-.695H0v4.006zm7.82-.646c-.408 0-.68-.208-.68-.537 0-.318.26-.522.714-.552l.926-.057v.307c0 .483-.427.839-.96.839zm-.284.71c.514 0 1.017-.268 1.248-.703h.018v.639h.908v-2.76c0-.804-.647-1.33-1.64-1.33-1.021 0-1.66.537-1.701 1.285h.873c.06-.332.344-.548.79-.548.464 0 .748.242.748.662v.287l-1.058.06c-.976.061-1.524.488-1.524 1.199 0 .721.564 1.209 1.338 1.209zm6.305-2.642c-.065-.843-.719-1.512-1.777-1.512-1.164 0-1.92.805-1.92 2.087 0 1.3.756 2.082 1.928 2.082 1.005 0 1.697-.59 1.772-1.485h-.888c-.087.453-.397.725-.873.725-.597 0-.982-.483-.982-1.322 0-.824.381-1.323.975-1.323.502 0 .8.321.876.748h.889zm2.906-2.967c-1.591 0-2.589 1.085-2.589 2.82 0 1.735.998 2.816 2.59 2.816 1.586 0 2.584-1.081 2.584-2.816 0-1.735-.997-2.82-2.585-2.82zm0 .832c.971 0 1.591.77 1.591 1.988 0 1.213-.62 1.984-1.59 1.984-.976 0-1.592-.77-1.592-1.984 0-1.217.616-1.988 1.591-1.988zm2.982 3.178c.042 1.006.866 1.626 2.12 1.626 1.32 0 2.151-.65 2.151-1.686 0-.813-.469-1.27-1.576-1.523l-.627-.144c-.67-.158-.945-.37-.945-.733 0-.453.415-.756 1.032-.756.623 0 1.05.306 1.096.817h.93c-.023-.96-.817-1.61-2.019-1.61-1.187 0-2.03.653-2.03 1.62 0 .78.477 1.263 1.482 1.494l.707.166c.688.163.967.39.967.782 0 .454-.457.779-1.115.779-.665 0-1.167-.329-1.228-.832h-.945z"/></svg>`,
      window: `<svg width="50" height="50" role="img" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><title>Windows</title><path d="M0 3.449L9.75 2.1v9.451H0m10.949-9.602L24 0v11.4H10.949M0 12.6h9.75v9.451L0 20.699M10.949 12.6H24V24l-12.9-1.801"/></svg>`,
      linux: `<svg width="50" height="50" role="img" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><title>Linux</title><path d="M12.504 0c-.155 0-.315.008-.48.021-4.226.333-3.105 4.807-3.17 6.298-.076 1.092-.3 1.953-1.05 3.02-.885 1.051-2.127 2.75-2.716 4.521-.278.832-.41 1.684-.287 2.489a.424.424 0 00-.11.135c-.26.268-.45.6-.663.839-.199.199-.485.267-.797.4-.313.136-.658.269-.864.68-.09.189-.136.394-.132.602 0 .199.027.4.055.536.058.399.116.728.04.97-.249.68-.28 1.145-.106 1.484.174.334.535.47.94.601.81.2 1.91.135 2.774.6.926.466 1.866.67 2.616.47.526-.116.97-.464 1.208-.946.587-.003 1.23-.269 2.26-.334.699-.058 1.574.267 2.577.2.025.134.063.198.114.333l.003.003c.391.778 1.113 1.132 1.884 1.071.771-.06 1.592-.536 2.257-1.306.631-.765 1.683-1.084 2.378-1.503.348-.199.629-.469.649-.853.023-.4-.2-.811-.714-1.376v-.097l-.003-.003c-.17-.2-.25-.535-.338-.926-.085-.401-.182-.786-.492-1.046h-.003c-.059-.054-.123-.067-.188-.135a.357.357 0 00-.19-.064c.431-1.278.264-2.55-.173-3.694-.533-1.41-1.465-2.638-2.175-3.483-.796-1.005-1.576-1.957-1.56-3.368.026-2.152.236-6.133-3.544-6.139zm.529 3.405h.013c.213 0 .396.062.584.198.19.135.33.332.438.533.105.259.158.459.166.724 0-.02.006-.04.006-.06v.105a.086.086 0 01-.004-.021l-.004-.024a1.807 1.807 0 01-.15.706.953.953 0 01-.213.335.71.71 0 00-.088-.042c-.104-.045-.198-.064-.284-.133a1.312 1.312 0 00-.22-.066c.05-.06.146-.133.183-.198.053-.128.082-.264.088-.402v-.02a1.21 1.21 0 00-.061-.4c-.045-.134-.101-.2-.183-.333-.084-.066-.167-.132-.267-.132h-.016c-.093 0-.176.03-.262.132a.8.8 0 00-.205.334 1.18 1.18 0 00-.09.4v.019c.002.089.008.179.02.267-.193-.067-.438-.135-.607-.202a1.635 1.635 0 01-.018-.2v-.02a1.772 1.772 0 01.15-.768c.082-.22.232-.406.43-.533a.985.985 0 01.594-.2zm-2.962.059h.036c.142 0 .27.048.399.135.146.129.264.288.344.465.09.199.14.4.153.667v.004c.007.134.006.2-.002.266v.08c-.03.007-.056.018-.083.024-.152.055-.274.135-.393.2.012-.09.013-.18.003-.267v-.015c-.012-.133-.04-.2-.082-.333a.613.613 0 00-.166-.267.248.248 0 00-.183-.064h-.021c-.071.006-.13.04-.186.132a.552.552 0 00-.12.27.944.944 0 00-.023.33v.015c.012.135.037.2.08.334.046.134.098.2.166.268.01.009.02.018.034.024-.07.057-.117.07-.176.136a.304.304 0 01-.131.068 2.62 2.62 0 01-.275-.402 1.772 1.772 0 01-.155-.667 1.759 1.759 0 01.08-.668 1.43 1.43 0 01.283-.535c.128-.133.26-.2.418-.2zm1.37 1.706c.332 0 .733.065 1.216.399.293.2.523.269 1.052.468h.003c.255.136.405.266.478.399v-.131a.571.571 0 01.016.47c-.123.31-.516.643-1.063.842v.002c-.268.135-.501.333-.775.465-.276.135-.588.292-1.012.267a1.139 1.139 0 01-.448-.067 3.566 3.566 0 01-.322-.198c-.195-.135-.363-.332-.612-.465v-.005h-.005c-.4-.246-.616-.512-.686-.71-.07-.268-.005-.47.193-.6.224-.135.38-.271.483-.336.104-.074.143-.102.176-.131h.002v-.003c.169-.202.436-.47.839-.601.139-.036.294-.065.466-.065zm2.8 2.142c.358 1.417 1.196 3.475 1.735 4.473.286.534.855 1.659 1.102 3.024.156-.005.33.018.513.064.646-1.671-.546-3.467-1.089-3.966-.22-.2-.232-.335-.123-.335.59.534 1.365 1.572 1.646 2.757.13.535.16 1.104.021 1.67.067.028.135.06.205.067 1.032.534 1.413.938 1.23 1.537v-.043c-.06-.003-.12 0-.18 0h-.016c.151-.467-.182-.825-1.065-1.224-.915-.4-1.646-.336-1.77.465-.008.043-.013.066-.018.135-.068.023-.139.053-.209.064-.43.268-.662.669-.793 1.187-.13.533-.17 1.156-.205 1.869v.003c-.02.334-.17.838-.319 1.35-1.5 1.072-3.58 1.538-5.348.334a2.645 2.645 0 00-.402-.533 1.45 1.45 0 00-.275-.333c.182 0 .338-.03.465-.067a.615.615 0 00.314-.334c.108-.267 0-.697-.345-1.163-.345-.467-.931-.995-1.788-1.521-.63-.4-.986-.87-1.15-1.396-.165-.534-.143-1.085-.015-1.645.245-1.07.873-2.11 1.274-2.763.107-.065.037.135-.408.974-.396.751-1.14 2.497-.122 3.854a8.123 8.123 0 01.647-2.876c.564-1.278 1.743-3.504 1.836-5.268.048.036.217.135.289.202.218.133.38.333.59.465.21.201.477.335.876.335.039.003.075.006.11.006.412 0 .73-.134.997-.268.29-.134.52-.334.74-.4h.005c.467-.135.835-.402 1.044-.7zm2.185 8.958c.037.6.343 1.245.882 1.377.588.134 1.434-.333 1.791-.765l.211-.01c.315-.007.577.01.847.268l.003.003c.208.199.305.53.391.876.085.4.154.78.409 1.066.486.527.645.906.636 1.14l.003-.007v.018l-.003-.012c-.015.262-.185.396-.498.595-.63.401-1.746.712-2.457 1.57-.618.737-1.37 1.14-2.036 1.191-.664.053-1.237-.2-1.574-.898l-.005-.003c-.21-.4-.12-1.025.056-1.69.176-.668.428-1.344.463-1.897.037-.714.076-1.335.195-1.814.12-.465.308-.797.641-.984l.045-.022zm-10.814.049h.01c.053 0 .105.005.157.014.376.055.706.333 1.023.752l.91 1.664.003.003c.243.533.754 1.064 1.189 1.637.434.598.77 1.131.729 1.57v.006c-.057.744-.48 1.148-1.125 1.294-.645.135-1.52.002-2.395-.464-.968-.536-2.118-.469-2.857-.602-.369-.066-.61-.2-.723-.4-.11-.2-.113-.602.123-1.23v-.004l.002-.003c.117-.334.03-.752-.027-1.118-.055-.401-.083-.71.043-.94.16-.334.396-.4.69-.533.294-.135.64-.202.915-.47h.002v-.002c.256-.268.445-.601.668-.838.19-.201.38-.336.663-.336zm7.159-9.074c-.435.201-.945.535-1.488.535-.542 0-.97-.267-1.28-.466-.154-.134-.28-.268-.373-.335-.164-.134-.144-.333-.074-.333.109.016.129.134.199.2.096.066.215.2.36.333.292.2.68.467 1.167.467.485 0 1.053-.267 1.398-.466.195-.135.445-.334.648-.467.156-.136.149-.267.279-.267.128.016.034.134-.147.332a8.097 8.097 0 01-.69.468zm-1.082-1.583V5.64c-.006-.02.013-.042.029-.05.074-.043.18-.027.26.004.063 0 .16.067.15.135-.006.049-.085.066-.135.066-.055 0-.092-.043-.141-.068-.052-.018-.146-.008-.163-.065zm-.551 0c-.02.058-.113.049-.166.066-.047.025-.086.068-.14.068-.05 0-.13-.02-.136-.068-.01-.066.088-.133.15-.133.08-.031.184-.047.259-.005.019.009.036.03.03.05v.02h.003z"/></svg>`,
      android: `<svg width="50" height="50" role="img" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><title>Android</title><path d="M17.523 15.3414c-.5511 0-.9993-.4486-.9993-.9997s.4483-.9993.9993-.9993c.5511 0 .9993.4483.9993.9993.0001.5511-.4482.9997-.9993.9997m-11.046 0c-.5511 0-.9993-.4486-.9993-.9997s.4482-.9993.9993-.9993c.5511 0 .9993.4483.9993.9993 0 .5511-.4483.9997-.9993.9997m11.4045-6.02l1.9973-3.4592a.416.416 0 00-.1521-.5676.416.416 0 00-.5676.1521l-2.0223 3.503C15.5902 8.2439 13.8533 7.8508 12 7.8508s-3.5902.3931-5.1367 1.0989L4.841 5.4467a.4161.4161 0 00-.5677-.1521.4157.4157 0 00-.1521.5676l1.9973 3.4592C2.6889 11.1867.3432 14.6589 0 18.761h24c-.3435-4.1021-2.6892-7.5743-6.1185-9.4396"/></svg>`,
      path : window.location.pathname.split('/')[2], // OTLanguage, Poison, Music, ...
    }
  },
  methods: {
    scroll(id) {
      const height = document.querySelector(id).offsetHeight
      const position = document.querySelector(id).offsetTop
      window.scrollTo({top:position - height, behavior:'smooth'})
    }
  }
}
</script>

<style scoped>
.dl, .dl-menu {
  margin-left: 10px;
  margin-right: 10px;
}

div.dl-icon-os {
  margin: auto;
  width: 90%;
  padding-top: 30px;
  padding-bottom: 100px;
}

div.dl-icon-os > p {
  margin-right: 50px;
  margin-left: 50px;
  padding-left: 30px;
  padding-right: 30px;
}

h1.dl, h2.dl, h3.dl, div.dl-icon-os {
  text-align: center;
}

ul.dl-menu > li {
  width: 100px; height: auto;
  padding: 30px; margin: 10px;
  display: inline-block;
  background: mediumpurple;
  color: black;
  border-radius: 20px;
  font-size: 150%;
}

.dl-menu > li:hover {
  font-weight: bolder;
  background: white;
  color: black;
}
</style>